Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # yandex_compute_disk.nfs-disk has been deleted
- resource "yandex_compute_disk" "nfs-disk" {
      - id          = "epdmbupujfrqtg8jg01l" -> null
        name        = "nfs-disk"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # yandex_compute_instance.master01 has been deleted
- resource "yandex_compute_instance" "master01" {
        id                        = "epd7m2gdv98f0qngmq93"
        name                      = "master01"
        # (10 unchanged attributes hidden)

      - network_interface {
          - ip_address         = "192.168.20.20" -> null
          - nat_ip_address     = "51.250.98.58" -> null
            # (8 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # yandex_compute_instance.worker01 has been deleted
- resource "yandex_compute_instance" "worker01" {
        id                        = "epdufmkl8l050f2ft118"
        name                      = "worker01"
        # (10 unchanged attributes hidden)

      - network_interface {
          - ip_address         = "192.168.20.21" -> null
          - nat_ip_address     = "158.160.18.139" -> null
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # yandex_compute_instance.worker02 has been deleted
- resource "yandex_compute_instance" "worker02" {
        id                        = "epd16c6h4fm074063jbq"
        name                      = "worker02"
        # (10 unchanged attributes hidden)

      - network_interface {
          - ip_address         = "192.168.20.22" -> null
          - nat_ip_address     = "84.201.178.122" -> null
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # yandex_vpc_network.default has been deleted
- resource "yandex_vpc_network" "default" {
      - id                        = "enp8aiv5d33cfcs90fd0" -> null
        name                      = "netology-net"
        # (5 unchanged attributes hidden)
    }

  # yandex_vpc_subnet.netology-subnet-b has been deleted
- resource "yandex_vpc_subnet" "netology-subnet-b" {
      - id             = "e2l300thdbudms8qcmoe" -> null
        name           = "netology-subnet-b"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.inventory must be replaced
-/+ resource "local_file" "inventory" {
      ~ content              = <<-EOT # forces replacement
            # Ansible inventory containing variable values from Terraform.
            # Generated by Terraform.
            node0 ansible_host=51.250.98.58 ip=192.168.20.20
            node1 ansible_host=158.160.18.139 ip=192.168.20.21
            node2 ansible_host=84.201.178.122 ip=192.168.20.22
            
            [kube_control_plane]
            node0
            
            [etcd]
            node0
            
            [kube_node]
            node1
            node2
            
            [k8s_cluster:children]
            kube_node
            kube_control_plane
            
            [k8s_cluster:vars]
            ansible_user=ubuntu
            
            [kube_control_plane:vars]
            apiserver_cert_extra_sans=51.250.98.58
        EOT -> (known after apply) # forces replacement
      ~ content_base64sha256 = "NXERNG8BfWfmR6vWAAirCDq4gV29LswQ9dXpVo3nWAY=" -> (known after apply)
      ~ content_base64sha512 = "R6yJsgu6kzhPlBOXmaT6ytUqTMeMZxEks3LxQvj//rua75L4A3uPqZOFQckhG09AkTkcgMsepI0OcJ4oQ0bZDA==" -> (known after apply)
      ~ content_md5          = "3b857f4afba39ea7cacaf1d44d2fb843" -> (known after apply)
      ~ content_sha1         = "db849955c7ece2d6d45780532f381674fcd609e5" -> (known after apply)
      ~ content_sha256       = "357111346f017d67e647abd60008ab083ab8815dbd2ecc10f5d5e9568de75806" -> (known after apply)
      ~ content_sha512       = "47ac89b20bba93384f94139799a4facad52a4cc78c671124b372f142f8fffebb9aef92f8037b8fa9938541c9211b4f4091391c80cb1ea48d0e709e284346d90c" -> (known after apply)
      ~ id                   = "db849955c7ece2d6d45780532f381674fcd609e5" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # yandex_compute_disk.nfs-disk will be created
+ resource "yandex_compute_disk" "nfs-disk" {
      + block_size  = 4096
      + created_at  = (known after apply)
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "nfs-disk"
      + product_ids = (known after apply)
      + size        = 20
      + status      = (known after apply)
      + type        = "network-hdd"
      + zone        = "ru-central1-b"
    }

  # yandex_compute_instance.master01 will be created
+ resource "yandex_compute_instance" "master01" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "master01.netology.yc"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCTR2s2Gjdpv2Sq9gBVGnsnZaN0hr8h+N05s03RZOgucyFZ7b2rRlav36Bl8Dg1noje9+o5zIha9bNYwpBmZLGJRsYLI9mmh7NRruapJr/nUYNcbzsZCRvRq85aORorA78KE86sCHgzaA4DNdY3B6TIVInVC1SvImwmhNKZaLu+yqk1v04T6AjfPc5QLb+tors3r2r+5esNj/8Ej9HEGsnXVQmcXRmRRck7FINXxoJdSgOFoKYYnLwCGboXeCtL7sl2G40HLqcclnjVs3lwXZkvkcmWmJcL02aqT4BtL+pDG6D9SUGu3kJIuD3+X+RcMPh+w83bDsefn6dF2s3R1Y06AdAr8JiyHDPsDvsImopCH8udwGCSemSCpo0Xq4LRx0SZx288PaHwFgNUgVZq0g2yIr2D5twAq0m7TWqbvi0qYOIoUbDc3CaDlmcZw9Zrq3rled8UyAjPHwb4sgzOroIavsfvEhkba97qmw/W6RcdjHphwjM/QaWJ8Ye4AK+uRFM= yelena@DESKTOP-T14F2UM
            EOT
        }
      + name                      = "master01"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80d16oleqvtagvi2ht"
              + name        = "root-master01"
              + size        = 44
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.20"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 4
        }

      + secondary_disk {
          + auto_delete = true
          + device_name = "nfs"
          + disk_id     = (known after apply)
          + mode        = "READ_WRITE"
        }
    }

  # yandex_compute_instance.worker01 will be created
+ resource "yandex_compute_instance" "worker01" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "worker01.netology.yc"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCTR2s2Gjdpv2Sq9gBVGnsnZaN0hr8h+N05s03RZOgucyFZ7b2rRlav36Bl8Dg1noje9+o5zIha9bNYwpBmZLGJRsYLI9mmh7NRruapJr/nUYNcbzsZCRvRq85aORorA78KE86sCHgzaA4DNdY3B6TIVInVC1SvImwmhNKZaLu+yqk1v04T6AjfPc5QLb+tors3r2r+5esNj/8Ej9HEGsnXVQmcXRmRRck7FINXxoJdSgOFoKYYnLwCGboXeCtL7sl2G40HLqcclnjVs3lwXZkvkcmWmJcL02aqT4BtL+pDG6D9SUGu3kJIuD3+X+RcMPh+w83bDsefn6dF2s3R1Y06AdAr8JiyHDPsDvsImopCH8udwGCSemSCpo0Xq4LRx0SZx288PaHwFgNUgVZq0g2yIr2D5twAq0m7TWqbvi0qYOIoUbDc3CaDlmcZw9Zrq3rled8UyAjPHwb4sgzOroIavsfvEhkba97qmw/W6RcdjHphwjM/QaWJ8Ye4AK+uRFM= yelena@DESKTOP-T14F2UM
            EOT
        }
      + name                      = "worker01"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80d16oleqvtagvi2ht"
              + name        = "root-worker01"
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.21"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }
    }

  # yandex_compute_instance.worker02 will be created
+ resource "yandex_compute_instance" "worker02" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "worker02.netology.yc"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCTR2s2Gjdpv2Sq9gBVGnsnZaN0hr8h+N05s03RZOgucyFZ7b2rRlav36Bl8Dg1noje9+o5zIha9bNYwpBmZLGJRsYLI9mmh7NRruapJr/nUYNcbzsZCRvRq85aORorA78KE86sCHgzaA4DNdY3B6TIVInVC1SvImwmhNKZaLu+yqk1v04T6AjfPc5QLb+tors3r2r+5esNj/8Ej9HEGsnXVQmcXRmRRck7FINXxoJdSgOFoKYYnLwCGboXeCtL7sl2G40HLqcclnjVs3lwXZkvkcmWmJcL02aqT4BtL+pDG6D9SUGu3kJIuD3+X+RcMPh+w83bDsefn6dF2s3R1Y06AdAr8JiyHDPsDvsImopCH8udwGCSemSCpo0Xq4LRx0SZx288PaHwFgNUgVZq0g2yIr2D5twAq0m7TWqbvi0qYOIoUbDc3CaDlmcZw9Zrq3rled8UyAjPHwb4sgzOroIavsfvEhkba97qmw/W6RcdjHphwjM/QaWJ8Ye4AK+uRFM= yelena@DESKTOP-T14F2UM
            EOT
        }
      + name                      = "worker02"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80d16oleqvtagvi2ht"
              + name        = "root-worker02"
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.22"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }
    }

  # yandex_vpc_network.default will be created
+ resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "netology-net"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.netology-subnet-a will be created
+ resource "yandex_vpc_subnet" "netology-subnet-a" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "netology-subnet-a"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.netology-subnet-b will be created
+ resource "yandex_vpc_subnet" "netology-subnet-b" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "netology-subnet-b"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 8 to add, 0 to change, 1 to destroy.

Changes to Outputs:
~ external_ip_address_node00 = "51.250.98.58" -> (known after apply)
~ external_ip_address_node01 = "158.160.18.139" -> (known after apply)
~ external_ip_address_node02 = "84.201.178.122" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://214a02e42bed:4141/lock?id=Scandr%252Fnetology_devops_diploma%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 8 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`